app/controllers/emails_controller.rb

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "rose"], ["body", "Pleasure in the job puts perfection in the work."], ["created_at", "2020-11-19 10:26:07.960546"], ["updated_at", "2020-11-19 10:26:07.960546"]]
---
  def create
    @email = Email.new()
    @email.object = Faker::Color.color_name
    @email.body = Faker::GreekPhilosophers.quote

    if @email.save

SELECT "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def show
  	@email = Email.all.find(params[:id])