app/views/emails/create.js.erb


document.getElementById('gmail_list').insertAdjacentHTML("beforeend", "<td><%= @email.object %></td> <td><%= @email.body %></td>");
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "raspberry"], ["body", "Only the educated are free."], ["created_at", "2020-11-19 15:58:10.159597"], ["updated_at", "2020-11-19 15:58:10.159597"]]