app/views/emails/index.html.erb

SELECT "emails".* FROM "emails"
---
<ul>
  <% Email.all.each do |email|  %>